# Homework

### Problem 1
In this question, we will use the csv file **Temp.csv**. 
- Read it into a data frame, call it `Temp`.

In [82]:
#### Your code here
import pandas as pd
Temp = pd.read_csv("Temp.csv")
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68

- We learned that the temperature at New Haven, Connecticut is currently 58 degree fahrenheit. Add this information into the DataFrame.

In [83]:
#### Your code here
newline = pd.DataFrame({'City':'New Haven',
                       'State':'Connecticut',
                       'Temperature':58},index=[7])
Temp = pd.concat([Temp,newline],axis = 0)
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68
7   New Haven  Connecticut           58

- Replace the names of the states by their abbreviations. That is 
    - Connecticut --> CT
    - New Jersey  --> NJ
    - New York    --> NY

In [87]:
#### Your code here
Temp['State'] = Temp['State'].replace('New York','NY')
Temp['State'] = Temp['State'].replace('New Jersey','NJ')
Temp['State'] = Temp['State'].replace('Connecticut','CT')
Temp

         City State  Temperature
0         NYC    NY           67
1      Albany    NY           49
2     Buffalo    NY           38
3    Hartford    CT           63
4  Bridgeport    CT           58
5      Treton    NJ           72
6      Newark    NJ           68
7   New Haven    CT           58

- Select the rows in New York.

In [89]:
#### Your code here
Temp[Temp.State=='NY']

      City State  Temperature
0      NYC    NY           67
1   Albany    NY           49
2  Buffalo    NY           38

- What is the average of the temperature of cities in NY?

In [98]:
#### Your code here
NY = Temp[Temp.State=='NY']
NY['Temperature'].mean()

51.333333333333336

- Find the mean and the standard deviation of the temperature of each state.

In [110]:
#### Your code here
group = Temp.groupby('State')
group.agg(['mean','std'])

      Temperature
             mean        std
State
CT      59.666667   2.886751
NJ      70.000000   2.828427
NY      51.333333  14.640128

- We know the capital of each state: 
    - Connecticut --> Hartford
    - New Jersey  --> Treton
    - New York    --> Albany
    
    Create a data frame, `Capital`, with two columns: State and Capital, which should look like:
    
|| State| Capital|
| :-: |:---: | :---:|
| 0| CT  | Hartford|
| 1| NJ | Treton|
| 2| NY| Albany|

In [109]:
#### Your code here
Capital = pd.DataFrame({'State':['CT','NJ','NY'],
                       'Capital':['Hartford','Treton','Albany']},
                      index = [0,1,2])
Capital

  State   Capital
0    CT  Hartford
1    NJ    Treton
2    NY    Albany

- Mutate a new boolean column, `Capital`, to `Temp`, which is `True` if the city in the row is the capital of the state, else `False`.

In [115]:
#### Your code here
Temp1 = pd.merge(Temp,Capital,on='State')
Temp1['Capital'] = Temp1['City'] == Temp1['Capital']
Temp1

         City State  Temperature  Capital
0         NYC    NY           67    False
1      Albany    NY           49     True
2     Buffalo    NY           38    False
3    Hartford    CT           63     True
4  Bridgeport    CT           58    False
5   New Haven    CT           58    False
6      Treton    NJ           72     True
7      Newark    NJ           68    False

### Problem 2

- a. Load the Gross Domestic Product data for the 190 ranked countries in the file **GDP.csv**. Load **Country.csv** into a DataFrame. 
- b. Match the data based on the country shortcode. How many of the IDs match? 
- c. Sort the data frame in descending order by GDP rank. What is the 13th country in the resulting data frame? (Note: GDP formats as 123,456,789.)
- d. What is the average GDP for the "High income: OECD" and "High income: nonOECD" group?
- e. What is the average GDP for different income groups and regions?

In [163]:
#### Your code here
# (a)
import numpy as np
import pandas as pd
gdp = pd.read_csv('GDP.csv', skiprows=range(5), header= None, usecols=[0,1,3,4], nrows=190, encoding='ISO-8859-1')
gdp.columns = ['CountryCode', 'Rank', 'CountryName', 'GDP']
country = pd.read_csv('Country.csv', encoding='ISO-8859-1')

In [8]:
# (b)
pd.merge(gdp,country,on='CountryCode').shape[0]

189

In [10]:
# (c)
temp = [int(x.replace(',','')) for x in gdp['GDP']]
gdp['GDP'] = temp
gdp.sort_values('GDP',ascending = False)['CountryName'][12]

Spain

In [191]:
# (d)
temp1 = pd.merge(country,gdp,on='CountryCode')
group1 = temp1.groupby('Income Group')
group1.mean()['GDP'][0:2]

Income Group
High income: OECD       1.483917e+06
High income: nonOECD    1.043498e+05
Name: GDP, dtype: float64

In [204]:
# (e)
group2 = temp1.groupby(['Income Group','Region'])
group2.mean()['GDP']

Income Group          Region
High income: OECD     East Asia & Pacific           2.197268e+06
                      Europe & Central Asia         7.567044e+05
                      Middle East & North Africa    2.582170e+05
                      North America                 9.033012e+06
High income: nonOECD  East Asia & Pacific           1.496240e+05
                      Europe & Central Asia         2.776660e+04
                      Latin America & Caribbean     2.795480e+04
                      Middle East & North Africa    2.142531e+05
                      North America                 5.474000e+03
                      Sub-Saharan Africa            1.769700e+04
Low income            East Asia & Pacific           8.154667e+03
                      Europe & Central Asia         6.723500e+03
                      Latin America & Caribbean     7.843000e+03
                      South Asia                    5.193833e+04
                      Sub-Saharan Africa            1.184393e+04
Lower middle income   East Asia & Pacific           6.604665e+05
                      Europe & Central Asia         4.314029e+04
                      Latin America & Caribbean     2.710667e+04
                      Middle East & North Africa    1.078699e+05
                      South Asia                    4.260556e+05
                      Sub-Saharan Africa            4.741100e+04
Upper middle income   East Asia & Pacific           1.030563e+05
                      Europe & Central Asia         2.696185e+05
                      Latin America & Caribbean     2.707134e+05
                      Middle East & North Africa    2.542647e+05
                      Sub-Saharan Africa            7.364683e+04
Name: GDP, dtype: float64